app/controllers/comments_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
INSERT INTO `comments` (`name`, `updated_at`, `title`, `body`, `date`, `post_id`, `user_id`, `created_at`) VALUES(NULL, '2008-12-06 12:45:39', 'sdf', 'dsf', NULL, 1, 2, '2008-12-06 12:45:39')
---
  def create
    @comment = Comment.new params[:comment]
    @post = Post.find params[:post_id]

    if @current_user
      @comment.name = nil
      @comment.user = @current_user
    end

    @comment.post = @post
    if @comment.save

SELECT * FROM `comments` WHERE (`comments`.`id` = 4)
DELETE FROM `comments` WHERE `id` = 4
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def destroy
    @comment = Comment.find params[:id]
    @comment.destroy
    @post = Post.find params[:post_id]