app/controllers/posts_controller.rb

INSERT INTO `posts` (`updated_at`, `title`, `body`, `date`, `created_at`) VALUES('2008-11-29 12:36:44', 'Сегодня был отличный день', 'Я спал', '2008-11-29', '2008-11-29 12:36:44')
---
  def create
    @post = Post.new params[:post]
    if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
DELETE FROM `posts` WHERE `id` = 4
---
  def destroy
    @post = Post.find params[:id]
    @post.destroy

SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
---
  def edit
    @post = Post.find params[:id]

SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
UPDATE `posts` SET `body` = 'Полдня спал, полдня работал. Весь в сомнениях. Буду думать дальше', `updated_at` = '2008-11-29 13:03:23' WHERE `id` = 3
---
  def update
    @post = Post.find params[:id]
    if @post.update_attributes(params[:post])

SELECT * FROM `posts` WHERE (`posts`.`id` = '3') LIMIT 1
---
  def show
    @post = Post.find params[:id]