app/controllers/users_controller.rb

INSERT INTO `users` (`is_author`, `updated_at`, `login`, `password`, `email`, `created_at`) VALUES(NULL, '2008-12-06 12:33:03', 'anayden', '123456', 'anayden@me.com', '2008-12-06 12:33:03')
---
  def create
    @user = User.new params[:user]
    if @user.save

SELECT * FROM `users` WHERE (`users`.`login` = 'test') LIMIT 1
---
  def login
    if params[:user]
      login = params[:user][:login]
      password = params[:user][:password]
      @user = User.find_by_login(login)